In [4]:

#Create a Pandas Series from a list
s=pd.Series([10,20,30,40,50])
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:

#Create a DataFrame from a dictionary:
data={
    "Name":["saniya","palak","pista"],
    "Marks":[90,91,92],
    "Attendance":[87,78,98]
}
df =pd.DataFrame(data)
print(df)

#Create a DataFrame with custom row and column labels
sd=pd.DataFrame(
    data,index=["s1","s2","s3"]
    ,columns=["Name","Attendance","Marks"]#if columns name doesn't exist earlier, then will show error
)
print(sd)

     Name  Marks  Attendance
0  saniya     90          87
1   palak     91          78
2   pista     92          98
      Name  Attendance  Marks
s1  saniya          87     90
s2   palak          78     91
s3   pista          98     92

In [1]:
import pandas as pd

#Read a CSV file into a DataFrame:
df=pd.read_csv('student.csv.csv')
df.head()

,student_id,gender,ssc_percentage,hsc_percentage,degree_percentage,cgpa,entrance_exam_score,technical_skill_score,soft_skill_score,internship_count,live_projects,work_experience_months,certifications,attendance_percentage,backlogs,extracurricular_activities,placement_status,salary_package_lpa
0,1,Male,53,79,56,8.87,50,92,90,1,3,23,4,91,4,Yes,0,0.00
1,2,Female,56,54,59,6.78,61,51,99,1,0,6,5,87,3,No,0,0.00
2,3,Male,94,83,83,7.92,91,93,84,1,1,10,2,81,2,No,1,6.92
3,4,Male,84,71,87,6.57,85,60,72,4,2,14,5,87,3,No,0,0.00
4,5,Male,58,88,74,9.01,73,52,88,1,2,20,0,60,1,No,0,0.00

In [5]:
#Read a CSV file into a DataFrame:
df=pd.read_csv('student.csv.csv')
df.tail()

,student_id,gender,ssc_percentage,hsc_percentage,degree_percentage,cgpa,entrance_exam_score,technical_skill_score,soft_skill_score,internship_count,live_projects,work_experience_months,certifications,attendance_percentage,backlogs,extracurricular_activities,placement_status,salary_package_lpa
4995,4996,Male,68,50,67,8.32,51,57,96,1,1,15,1,71,4,Yes,0,0.0
4996,4997,Female,61,52,56,9.47,61,59,62,3,4,0,3,73,5,Yes,0,0.0
4997,4998,Male,74,76,58,6.19,40,99,89,1,1,2,2,67,1,No,0,0.0
4998,4999,Female,84,67,66,8.07,40,48,92,4,1,6,4,61,0,No,0,0.0
4999,5000,Female,61,79,64,6.97,42,80,59,4,5,2,5,93,4,Yes,0,0.0

In [ ]:
#